{
    "course": {
      "title": "Programming Fundamentals Part 1 (Python)",
      "crn": "COMP 1516",
      "subject": "Computer Systems",
      "scope": "Course",
      "overview": {
        "descr": "Students with no prior computer programming experience are introduced to using Python to write simple programs. This hands-on introductory computer programming course is the foundation for all BCIT Computing Flexible Learning programming courses. COMP 1516 is not a Python development course, it is the first step in a series of three (3) applied programming fundamentals courses. Students must provide their own current model Windows capable PC, i5 or higher equivalent processor, 8 GB of RAM minimum, and 256 GB minimum storage. High-speed internet access is needed for online sections and for homework. Topics include: Data structures, data modelling, programming constructs, lists, strings, sets and maps. Labs and exercises focus on writing code for projects, assignments, and activities. Participants will design, implement, test, and debug simple programs that incorporate: variables, expressions, assignments, I/O, conditional and iterative control constructs, functions, and parameter passing. Please Note: Attendance, participation in class and the BCIT Learning Hub are mandatory. Students may have an average total time commitment of 15 hours per week; 3 hours of class time, a 1-hour online component and 10+ hours of homework each week. COMP 1516 is required for the Applied Software Development (ASD) and the Applied Computer Information (ACIS) Associate Certificates, as well as the Computer Systems Certificate (CSC). Upon completion, successful students will have a basic understanding of computer programming and be prepared to move on to COMP 2501 –Programming Fundamentals Part 2.​",
        "prereq": ["COMP 1002"],
        "credits": 4.0,
        "domestic_fees": {
          "min": 556.96,
          "max": 599.00
        }
      },
      "outcomes": [
        "Install and set-up Python.",
        "Analyze and explain the behavior of simple programs.",
        "Create simple algorithms for solving simple problems.",
        "Choose the appropriate data structure for modeling a given problem.",
        "Choose appropriate conditional and iteration constructs for a given programming task.",
        "Apply the techniques of decomposition to break a program into smaller pieces.",
        "Write programs that use primitive data types, variables, expressions, and command line I/O.",
        "Write programs that use conditional and iterative control structures, functions, and parameter passing.",
        "Write programs that use each of the following data structures: lists, strings, sets, and dictionaries.",
        "Write programs using the standard libraries available with a chosen programming language.",
        "Write programs that use file I/O to provide persistence across multiple executions.",
        "Design and implement a class.",
        "Utilize Regular expressions to build search patterns.",
        "Apply a variety of strategies to the testing and debugging of simple programs.",
        "Conduct a personal code review on a program component.",
        "Practice how to work with a partner as part of a team.",
        "Move on to COMP 2501 - Programming Fundamentals Part 2."
      ],
      "related_programs": [
        "Applied Computer Information Systems (ACIS)",
        "Applied Software Development (ASD)",
        "Computer Systems Certificate (CSC)"
      ],
      "offerings": [
        {
          "term": "Fall 2024",
          "schedule": [
            {
              "crn": 46994,
              "status": {
                "name": "In Progress",
                "value": "inProgress"
              },
              "domestic_fee": 556.96,
              "dates": "Sep 07 - Dec 07",
              "meeting_metrics": [
                {
                  "dates": "Sep 07 - Dec 07",
                  "days": "Sat",
                  "times": "09:00 - 12:00",
                  "locations": "Online"
                },
                {
                  "dates": "Sep 07 - Dec 07",
                  "days": "N/A",
                  "times": "N/A",
                  "locations": "Online"
                }
              ],
              "instructor": "Jason Wilder",
              "outline": "https://www.bcit.ca/outlines/20243046994"
            },
            {
              "crn": 46988,
              "status": {
                "name": "Full",
                "value": "full"
              },
              "domestic_fee": 556.96,
              "dates": "Sep 09 - Dec 09",
              "meeting_metrics": [
                {
                  "dates": "Sep 09 - Dec 09",
                  "days": "Mon",
                  "times": "18:00 - 21:00",
                  "locations": "Online"
                },
                {
                  "dates": "Sep 09 - Dec 09",
                  "days": "N/A",
                  "times": "N/A",
                  "locations": "Online"
                }
              ],
              "instructor": "Mike Mulder",
              "outline": "https://www.bcit.ca/outlines/20243046988"
            }
          ]
        },
        {
          "term": "Winter 2025",
          "schedule": [
            {
              "crn": 88159,
              "status": {
                "name": "Available",
                "value": "available"
              },
              "domestic_fee": 584.71,
              "dates": "Jan 07 - Mar 25",
              "meeting_metrics": [
                {
                  "dates": "Jan 07 - Mar 25",
                  "days": "Tue",
                  "times": "18:00 - 21:00",
                  "locations": "Downtown DTC Rm. 382"
                },
                {
                  "dates": "Jan 07 - Mar 25",
                  "days": "N/A",
                  "times": "N/A",
                  "locations": "Online"
                }
              ],
              "instructor": "Rana Al-Sammarraie",
              "outline": "https://www.bcit.ca/courses/programming-fundamentals-part-1-python-comp-1516/#outcomes"
            }
          ]
        }
      ]
    }
  }